// Welcome
const next = "بعدی";
const loginText = "ورود";
// Welcome -- Page1
const firstWelcome = "به اپلیکیشن انتظامات خوش آمدید";
// Welcome -- Page2
const secondWelcome = "تم مورد نظر را انتخاب کنید";
const lightTheme = "روشن";
const darkTheme = "تاریک";
// Welcome -- Page3 -- Login
const personalCodeText = "کد پرسنلی";
const passwordCodeText = "گذرواژه";
const forgetPassword = "گذرواژه خود را فراموش کرده اید؟";
// Will be next fist visit statment to show new page

// Side Menu
// Side Menu -- Home text
const homeText = "نمایش جایگاه ها";
// Side Menu -- Search text
const searchText = "جست و جو پلاک";
// Side Menu -- Slot text
const slotText = "جست و جو جايگاه";
// Side Menu -- searching With Personal code
const personalCodeSearchText = "جست و جو با کد پرسنلی";
// Side Menu -- searching With Personal code
const searchingByPhotoCapturing = "جست و جو با گرفتن عکس";
// Side Menu -- Enter text
const enterText = "ثبت ورود";
// Side Menu -- Exit text
const exitText = "ثبت خروج";
// Side Menu -- Saved
const saved = "اطلاعات ذخیره شده";
// Side Menu -- Theme text
const themeText = "محیط روشن / تاریک";
// Settings text
const initSettingsText = "تنظیمات";

// Home <<Slots View>>
// APP bar
const securityAppBarText = "اپليکيشن انتظامات";
const slotsTitleText = "جایگاه های پارکینگ";

// On pressed slots
const slotTitleInBottomAction = "شماره جایگاه";
const slotStatusString = ": وضعیت جایگاه";

// Menu For Grid Number showing

// Searching
const searchBtnText = "جست و جو";
// Plate Search
const plateSearchTip =
    "پلاک وسیله نقلیه مورد نظر را مانند نمونه وارد کرده تا بتوانید اطلاعات مربوط به جایگاه آن را مشاهده نمایید";
// Slots Search
const slotSearchTip =
    "شماره جایگاه را وارد کرده تا موقعیت وسیله نقلیه متناسب با شماره جایگاه وارد شده را دریافت کنید";

const persCodeSearchTip =
    "شناسه پرسنلی فرد مورد نظر را وارد کرده تا موقعیت وسیله نقلیه متناسب را دریافت کنید";

const searchingByCameraTextTooltip =
    "شما در این قسمت باید با استفاده از دوربین تلفن همراه یا از آلبوم تصاویر خود، تصویر وسیله نقلیه مورد نظر را وارد کرده تا مشخصات آن را مشاهده نمایید";

const slotNumberInSearch = "شماره جایگاه";

const persCodeInSearch = "شناسه پرسنلی";

// Search Results
const resultSearch = "نتیجه جست و جوی شما";
const fullDetails = "اطلاعات تکمیلی";
// Detailes Titles
const slotNumberResult = "شماره جایگاه";
const slotStatusResult = "وضعیت جایگاه";
const resultSlotTip = "موقعیت جایگاه جست و جو شده";
const entryTimeResult = "زمان ورود";
const exitTimeResult = "زمان خروج";
const resultTimeTips =
    "وضعیت زمانی، در چه ساعاتی تردد و ورود - خروج صورت گرفته است";

// Submission text
const submissionTipText =
    "شما در این قسمت باید با استفاده از دوربین تلفن همراه یا از آلبوم تصاویر خود، تصویر وسیله نقلیه مورد نظر را وارد کرده تا وضعیت تردد آن مشخص گردد";
const cameraBtnText = "دوربین";
const galleryBtnText = "آلبوم تصاویر";
const send = "ارسال";
const abort = "لفو";

// Error handle
const emptyTextFieldMsg = "فیلد نباید خالی باشد!";
// Login Auth checker msg
const loginIsFailedByUsernameorPassTitle = "مشکل در ورود";
const loginIsFailedByUsernameorPassDsc =
    "شناسه پرسنلی یا گذرواژه خود را بررسی کنید";
// building for users
const submitMsg = "ثبت ساختمان و ورود";

// If Saving data has problem
const savingProblemTitle = "عملیات ناموفق";
const savingProblemDsc =
    "عملیات ذخیره سازی داده های شما به مشکل برخورده است، لطفا با توسعه دهنده در ارتباط باشید";

// Strings in Confirmation
const submitUpdateStaffInfo = "بروزرسانی اطلاعات جدید";

// Email
const emailText = "آدرس پست الکترونیکی";

// Update user info
const emptyBoxTitle = "برخی از فیلد ها خالی هستند";
const emptyBoxDsc = "باید تمامی فیلد های خواسته شده را پر کنید";
const notMathPassTitle = "مشکل در مطابقت";
const notMathPassDsc = "گذرواژه ها باهم یکسان نیستند";
const emailValTitle = "آدرس پست الکترونیکی نامعتبر";
const emailValDsc = "آدرس پست الکترونیکی شما معتبر و استاندارد نمی باشند";
const passValTitle = "گذرواژه های نامعتبر";
const passValDsc = "گذواژه شما باید ترکیبی از حروف بزرگ و کوچک و اعداد باشد";
const passwordWouldGTTitle = "طول گذرواژه شما کم است";
const passwordWouldGTDesc =
    "طول گذرواژه شما بایستی بیشتر یا مساوی ۶ کارکتر باشد";
const updaingProblemTitle = "مشکلی در بارگذاری اطلاعات";
const updaingProblemDsc =
    "ممکن است ارتباط شما با سرویس دهنده قطع شده باشد یا اینکه مشکل از سرویس دهنده باشد";

// Profile -> Uploading avatar
const successSendTitle = "عملیات موفقیت آمیز";
const successSendDsc = "آواتار شما تا چند لحظه دیگر آپلود خواهد شد";
const failureSendTitle = "عملیات با شکست مواجه شد";
const failureSendDsc = "آواتار شما ثبت نشد";

const notFoundTitle = "داده ای یافت نشد";
const notFoundDsc = "نتیجه جست و جو خالی است،‌ لطفا جست و جوی دیگیری نمایید";
const emptyPlateTitle = "پلاک نامعتبر";
const emptyPlateDsc =
    "برخی از قسمت های پلاک خالی است، لطفا پلاک معتبر را وارد کنید";

// In alert check tip
const attentionInSendingData =
    "به یاد داشته باشید، هنگامی که به شبکه اینترنت داخلی خود متصل نباشید اطلاعاتی که قرار است به سمت سرویس دهنده بفرستید در حافظه داخلی در قسمت ذخیره شده ها، قرار خواهد گرفت، و در آنجا بایستی ارسال خود را توسط شبکه داخلی متصل شده ارسال نمایید";
const understandingMater = "بله متوجه شدم";

const savedSuccessFull =
    "به دلیل عدم اتصال به اینترنت یا خطا در ارسال، ذخیره سازی موفقیت آمیز بود";
const savedSuccessBtn = "تایید";

const notFoundInfoInBookmarkStorage = "شما ایتم ذخیره شده ای ندارید";

// const sendAgainTitle = "ارسال موفقیت آمیز";
// const sendAgainDsc = "تصویر شما با موفقیت ارسال شد";
const notSendAgainTitle = "ارسال ناموفق";
const notSendAgainDsc = "شما هنوز آفلاین و خارج از شبکه داخلی هستید";
const resultOfSending = "نتیجه پردازش تصویر";

// Result of Image processing
const submissionMsg = "تصویر ثبت شد ✅";
const badImgEquality = "کیفیت تصویر خوب نیست 📵";
const notFoundInfoForThis = "اطلاعاتی در مورد این پلاک موجود نیست ❌";
const failedResponse = "اطلاعات پلاک یافت نشد";
const notEmptyMsg = "پارکینگ پر است";
const recentlyUsedMsg = "این پلاک قبلا ثبت شده است";

const editedEmailSubmited = "آدرس پست الکترونیکی شما با موفقیت ویرایش شد";
const failureEmailSubmit = "ویرایش آدرس پست الکترونیکی شما با شکست رو به رو شد";
const emptyMsgTitle = "فیلد خالی نمیتوان پذیرفت";
const emptyMsgDsc = "لطفا فیلد آدرس پست الکترونیکی خود را پر کنید";

const emailRegexFailedTitle = "آدرس پست الکترونیکی نامعتبر";
const emailRegexFailedDsc = "آدرس پست الکترونیکی وارد شده نامعتبر است";

// Change New Password
const passChangedTitle = "ویرایش گذرواژه موفقیت آمیز بود";
const passChangedDsc = "گذرواژه جدید شما در سرویس دهنده با موفقیت ثبت شد";
const passNotChangedTitle = "ویرایش گذرواژه جدید ما مشکل مواجه شده است";
const passNotChangedDsc =
    "ثبت گذرواژه جدید شما با مشکل رو به رو شده است، لطفا بعدا مراجعه کنید";

const passInvalidTitle = "گذواژه جدید شما نامعبتر است";
const passInvalidDsc =
    "لطفا گدرواژه ای معتبر وارد کنید که ترکیبی از حروف بزرگ و کوچک اعلائم و اعداد باشد";

const passNoEnoughLenTitle = "طول گذرواژه کم است";
const passNoEnoughLenDsc = "گذرواژه شما باید بیشتر یا مساوی ۶ کارکتر باشد";

const passNotMatchTitle = "گذرواژه های ناهمسان";
const passNotMatchDsc = "گذرواژه های شما با یکدیگر همسان نیست";

// Terms of Service
const termsAndLicense = "شرایط و ضوابط";
const termsLastUpdate = "آخرین بروزرسانی در";
const terms = ''' 
- پارکینگ ساختمان های همراه اول به دو گروه تقسیم می شوند:

  -  گروه اول : شامل پارکینگ‌های برج همراه، ستاره ونک و ساختمان شماره 3 که تخصیص آن بصورت متغیر و براساس اپلیکیشن رزرو پارکینگ صورت می‌پذیرد.

  -  گروه دوم : شامل پارکینگ‌های ساختمان شماره 4، عطار، شادی و رویال پلازا می‌باشند می‌باشند که تخصیص آن بصورت دوره ای می‌باشد.

  - **نکته : رزرو لحظه ای و رزرو هفتگی مختص گروه اول و رزرو دوره ای مختص گروه دوم می باشد**

-	مالکیت خودرو باید به نام خود شخص، پدر، مادر، همسر و یا فرزند باشد.

-	مالکیت خودرو در صورت موارد غیر اعلامی در بند۲، با ارائه اسناد مثبته که شامل مدارک مالکیت خودرو)سند خودرو، شناسنامه و کارت ملی مالک خودرو و احراز و تایید اداره امور داخلی امکان پذیر می‌باشد(که در این مورد فرد متقاضی با در دست داشتن مدارک به صورت حضوری به اداره امور داخلی مراجعه می‌نماید.

-	در صورتی که به هر دلیلی مشخصات و پلاک خودرو کارکنان تغییر کند باید پیش از استفاده از پارکینگ، مشخصات و پلاک خودروی جدید از طریق اپلیکشن رزرو خودرو اعلام تا مورد بررسی قرار گرفته و در صورت صحت اطلاعات به اداره کل حراست اعلام تا امکان ورود به ساختمان‌های شرکت جهت استفاده از پارکینگ صورت پذیرد. تا زمانی که اطلاعات خودروی جدید در سامانه اطلاعاتی به‌روز نشود، فرد قادر به استفاده از پارکینگ نخواهد بود. پس از به‌روزرسانی اطلاعات خودرو، این کارکنان می‌توانند از پارکینگ استفاده کنند.

-	متقاضی پارکینگ حداکثر دو خودرو می‌تواند معرفی نماید.

-	نام کاربری و رمز عبور پیش فرض برابر با کد مستخدمی می‌باشد.

- برای رزرو روزانه یا به عبارتی رزرو لحظه ای، درخواست رزرو باید از ساعت ۱۷:۰۰ لغایت ۱۷:۰۰ روز بعد، از طریق اپلیکیشن اقدام گردد

-	 برای رزرو هفتگی نسبت به رزرو / انصراف پارکینگ باید از ساعت 10:00 روز شنبه لغایت ساعت 23:00 روز پنج شنبه از طریق اپلیکیشن اقدام گردد.

-	ارسال درخواست بصورت رزرو دوره ای در هفته آخر هر دوره امکان پذیر می باشد.

-	کارکنانی که از رزرو لحظه‌ای درخواست خود را اعلام می‌نمایند پس از تخصیص پارکینگ امکان انصراف رزرو برای آنها وجود نخواهد داشت.

-	به درخواست‌هایی که پس از زمان مقرر ثبت شوند، ترتیب اثر داده نخواهد شد.

-	متقاضی در صورت عدم استفاده از پارکینگ باید درخواست انصراف خود را از طریق اپلیکیشن اعلام نماید. 

**توجه: در صورت مرخصی یا ماموریت و... باید برای آن روز/روزها درخواست انصراف خود را از طریق اپلیکیشن اعلام نماید.**

-	کارکنان نمی‌توانند بدون سامانه رزرو تخصیص پارکینگ از پارکینگ‌های شرکت استفاده نمایند.

-	به ازای هر روز استفاده از پارکینگ یک امتیاز کسر می گردد.

-	تمامی سطوح مدیریتی در شرکت در صورت عدم استفاده از پارکینگ باید نسبت به اعلام انصراف خود اقدام نمایند تا  ظرفیت پارکینگ به کارشناسان تخصیص یابد.

-	متقاضیان در صورت پارک در پارکینگ های دیگر تا دو مرتبه به مدت یک روز امکان رزرو و استفاده از پارکینگ را نخواهند داشت.

-	متقاضیان درصورت پارک در پارکینگ های دیگر از مرتبه سوم به بالا به مدت 5 روز متوالی امکان رزرو و استفاده از پارکینگ را نخواهند داشت.

-	متقاضیان در صورت عدم استفاده از پارکینگ رزرو شده تا 2 مرتبه به مدت 5 روز متوالی امکان رزرو و استفاده از پارکینگ را نخواهند داشت.

-	متقاضیان در صورت عدم استفاده از پارکینگ رزرو شده از مرتبه سوم و به بالا به مدت 8 روز متوالی امکان رزرو و استفاده از پارکینگ را نخواهند داشت.

-	متقاضیان در صورت عدم تخلیه از پارکینگ در پایان روز رزرو تا 2 مرتبه به مدت 5 روز متوالی امکان رزرو و استفاده از پارکینگ را نخواهند داشت.

-	متقاضیان در صورت عدم تخلیه از پارکینگ در پایان روز رزرو از مرتبه سوم به بالا به مدت 15 روز متوالی امکان استفاده از پارکینگ را نخواهند داشت.

-	برای نفراتی که دارای امتیاز مساوی می‌باشند اولویت با کسی است که کمترین استفاده از پارکینگ را داشته است.

-	کسر امتیاز در زمان ثبت درخواست بعدی کارکنان در اپلیکیشن اعمال خواهد شد.

-	با توجه به هوشمند بودن سامانه رزرو پارکینگ و عملکرد گیت‌ها با دوربین های پلاک خوان، ورود و خروج دارندگان موتور سیکلت تنها با پلاک خوان امکان پذیر می‌باشد.

-	پس از مشخص شدن جایگاه پارکینگ از طریق پیامک یا اپلیکشن به فرد متقاضی نام ساختمان، طبقه و شماره پارکینگ اعلام می‌گردد و در صورت عدم تعلق، پیام عدم تخصیص برای وی ارسال می‌گردد. فردی که پارکینگ به وی تخصیص داده شده است در روز و تاریخ تعیین شده به محل پارکینگ رفته و می‌تواند خودروی خود را پارک نماید.

-	دارندگان موتور سیکلت موظف می‎‌باشند تنها در محل‌های مشخص شده پارک نمایند.

-	برای تخصیص روزانه پارکینگ موتور سیکلت ، نیازی به استفاده از اپلیکیشن رزرو تخصیص پارکینگ نمی‌باشد.

''';
