// Welcome
const next = "بعدی";
const loginText = "ورود";
// Welcome -- Page1
const firstWelcome = "به اپلیکیشن انتظامات خوش آمدید";
// Welcome -- Page2
const secondWelcome = "تم مورد نظر را انتخاب کنید";
const lightTheme = "روشن";
const darkTheme = "تاریک";
// Welcome -- Page3 -- Login
const personalCodeText = "کد پرسنلی";
const passwordCodeText = "گذرواژه";
const forgetPassword = "گذرواژه خود را فراموش کرده اید؟";
// Will be next fist visit statment to show new page

// Side Menu
// Side Menu -- Home text
const homeText = "نمایش جایگاه ها";
// Side Menu -- Search text
const searchText = "جست و جوی پلاک";
// Side Menu -- Slot text
const slotText = "جست و جوی جايگاه";
// Side Menu -- searching With Personal code
const personalCodeSearchText = "جست و جوی با کد پرسنلی";
// Side Menu -- searching With Personal code
const searchingByPhotoCapturing = "جست و جوی با گرفتن عکس";
// Side Menu -- Enter text
const enterText = "ثبت ورود";
// Side Menu -- Exit text
const exitText = "ثبت خروج";
// Side Menu -- Saved
const saved = "اطلاعات ذخیره شده";
// Side Menu -- Theme text
const themeText = "محیط روشن / تاریک";
// Settings text
const initSettingsText = "تنظیمات";

// Home <<Slots View>>
// APP bar
const securityAppBarText = "اپليکيشن انتظامات";
const slotsTitleText = "جایگاه های پارکینگ";
// Menu For Grid Number showing

// Searching
const searchBtnText = "جست و جو";
// Plate Search
const plateSearchTip =
    "پلاک وسیله نقلیه مورد نظر را مانند نمونه وارد کرده تا بتوانید اطلاعات مربوط به جایگاه آن را مشاهده نمایید";
// Slots Search
const slotSearchTip =
    "شماره جایگاه را وارد کرده تا موقعیت وسیله نقلیه متناسب با شماره جایگاه وارد شده را دریافت کنید";

const persCodeSearchTip =
    "شناسه پرسنلی فرد مورد نظر را وارد کرده تا موقعیت وسیله نقلیه متناسب را دریافت کنید";

const searchingByCameraTextTooltip =
    "شما در این قسمت باید با استفاده از دوربین تلفن همراه یا از آلبوم تصاویر خود، تصویر وسیله نقلیه مورد نظر را وارد کرده تا مشخصات آن را مشاهده نمایید";

const slotNumberInSearch = "شماره جایگاه";

const persCodeInSearch = "شناسه پرسنلی";

// Search Results
const resultSearch = "نتیجه جست و جوی شما";
const fullDetails = "اطلاعات تکمیلی";
// Detailes Titles
const slotNumberResult = "شماره جایگاه";
const slotStatusResult = "وضعیت جایگاه";
const resultSlotTip = "موقعیت جایگاه جست و جو شده";
const entryTimeResult = "زمان ورود";
const exitTimeResult = "زمان خروج";
const resultTimeTips =
    "وضعیت زمانی، در چه ساعاتی تردد و ورود - خروج صورت گرفته است";

// Submission text
const submissionTipText =
    "شما در این قسمت باید با استفاده از دوربین تلفن همراه یا از آلبوم تصاویر خود، تصویر وسیله نقلیه مورد نظر را وارد کرده تا وضعیت تردد آن مشخص گردد";
const cameraBtnText = "دوربین";
const galleryBtnText = "آلبوم تصاویر";
const send = "ارسال";
const abort = "لفو";

// Error handle
const emptyTextFieldMsg = "فیلد نباید خالی باشد!";
// Login Auth checker msg
const loginIsFailedByUsernameorPassTitle = "مشکل در ورود";
const loginIsFailedByUsernameorPassDsc =
    "شناسه پرسنلی یا گذرواژه خود را بررسی کنید";
// building for users
const submitMsg = "ثبت ساختمان و ورود";

// If Saving data has problem
const savingProblemTitle = "عملیات ناموفق";
const savingProblemDsc =
    "عملیات ذخیره سازی داده های شما به مشکل برخورده است، لطفا با توسعه دهنده در ارتباط باشید";

// Strings in Confirmation
const submitUpdateStaffInfo = "بروزرسانی اطلاعات جدید";

// Email
const emailText = "آدرس پست الکترونیکی";

// Update user info
const emptyBoxTitle = "برخی از فیلد ها خالی هستند";
const emptyBoxDsc = "باید تمامی فیلد های خواسته شده را پر کنید";
const notMathPassTitle = "مشکل در مطابقت";
const notMathPassDsc = "گذرواژه ها باهم یکسان نیستند";
const emailValTitle = "آدرس پست الکترونیکی نامعتبر";
const emailValDsc = "آدرس پست الکترونیکی شما معتبر و استاندارد نمی باشند";
const passValTitle = "گذرواژه های نامعتبر";
const passValDsc =
    "گذواژه شما باید ترکیبی از حروف بزرگ و کوچک، اعداد و علامت هایی باشد مانند زیر \n 1234asD@";
const updaingProblemTitle = "مشکلی در بارگذاری اطلاعات";
const updaingProblemDsc =
    "ممکن است ارتباط شما با سرویس دهنده قطع شده باشد یا اینکه مشکل از سرویس دهنده باشد";

// Profile -> Uploading avatar
const successSendTitle = "عملیات موفقیت آمیز";
const successSendDsc = "آواتار شما تا چند لحظه دیگر آپلود خواهد شد";
const failureSendTitle = "عملیات با شکست مواجه شد";
const failureSendDsc = "آواتار شما ثبت نشد";

const notFoundTitle = "داده ای یافت نشد";
const notFoundDsc = "نتیجه جست و جو خالی است،‌ لطفا جست و جوی دیگیری نمایید";
const emptyPlateTitle = "پلاک نامعتبر";
const emptyPlateDsc =
    "برخی از قسمت های پلاک خالی است، لطفا پلاک معتبر را وارد کنید";

// In alert check tip
const attentionInSendingData =
    "به یاد داشته باشید، هنگامی که به شبکه اینترنت داخلی خود متصل نباشید اطلاعاتی که قرار است به سمت سرویس دهنده بفرستید در حافظه داخلی در قسمت ذخیره شده ها، قرار خواهد گرفت، و در آنجا بایستی ارسال خود را توسط شبکه داخلی متصل شده ارسال نمایید";
const understandingMater = "بله متوجه شدم";

const savedSuccessFull =
    "به دلیل عدم اتصال به اینترنت یا خطا در ارسال، ذخیره سازی موفقیت آمیز بود";
const savedSuccessBtn = "تایید";

const notFoundInfoInBookmarkStorage = "شما ایتم ذخیره شده ای ندارید";

// const sendAgainTitle = "ارسال موفقیت آمیز";
// const sendAgainDsc = "تصویر شما با موفقیت ارسال شد";
const notSendAgainTitle = "ارسال ناموفق";
const notSendAgainDsc = "شما هنوز آفلاین و خارج از شبکه داخلی هستید";
const resultOfSending = "نتیجه پردازش تصویر";

// Result of Image processing
const submissionMsg = "تصویر ثبت شد ✅";
const badImgEquality = "کیفیت تصویر خوب نیست 📵";
const notFoundInfoForThis = "اطلاعاتی در مورد این پلاک موجود نیست ❌";
const failedResponse = "اطلاعات پلاک یافت نشد";
const notEmptyMsg = "پارکینگ پر است";
const recentlyUsedMsg = "این پلاک قبلا ثبت شده است";

const editedEmailSubmited = "آدرس پست الکترونیکی شما با موفقیت ویرایش شد";
const failureEmailSubmit = "ویرایش آدرس پست الکترونیکی شما با شکست رو به رو شد";
const emptyMsgTitle = "فیلد خالی نمیتوان پذیرفت";
const emptyMsgDsc = "لطفا فیلد آدرس پست الکترونیکی خود را پر کنید";

const emailRegexFailedTitle = "آدرس پست الکترونیکی نامعتبر";
const emailRegexFailedDsc = "آدرس پست الکترونیکی وارد شده نامعتبر است";

// Change New Password
const passChangedTitle = "ویرایش گذرواژه موفقیت آمیز بود";
const passChangedDsc = "گذرواژه جدید شما در سرویس دهنده با موفقیت ثبت شد";
const passNotChangedTitle = "ویرایش گذرواژه جدید ما مشکل مواجه شده است";
const passNotChangedDsc =
    "ثبت گذرواژه جدید شما با مشکل رو به رو شده است، لطفا بعدا مراجعه کنید";

const passInvalidTitle = "گذواژه جدید شما نامعبتر است";
const passInvalidDsc =
    "لطفا گدرواژه ای معتبر وارد کنید که ترکیبی از حروف بزرگ و کوچک اعلائم و اعداد باشد";

const passNoEnoughLenTitle = "طول گذرواژه کم است";
const passNoEnoughLenDsc = "گذرواژه شما باید بیشتر یا مساوی ۶ کارکتر باشد";

const passNotMatchTitle = "گذرواژه های ناهمسان";
const passNotMatchDsc = "گذرواژه های شما با یکدیگر همسان نیست";

// Terms of Service
const termsAndLicense = "شرایط و ضوابط";
const termsLastUpdate = "آخرین بروزرسانی در";
const terms = ''' 
1. شرایط 

   لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از  طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و  سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه  درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با  نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان  خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید  داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات  پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.

2. مجوز ها و سیاست های ما

   - لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از  طراحان گرافیک است.
   - چاپگرها و متون بلکه روزنامه و مجله در ستون و  سطرآنچنان که لازم است.
   - برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
   - کتابهای زیادی در شصت و سه  درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با  نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان  خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید  داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات  پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. 
''';
